tutorials/suspensionFlows/equilibriumEulerianFoam/2Dpacking/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    maxY
    {
        type            cyclic;
    }
    minX
    {
        type            cyclic;
    }
    maxX
    {
        type            cyclic;
    }
    minY
    {
        type            cyclic;
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    pores
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
