tutorials/suspensionFlows/equilibriumEulerianFoam/2Dpacking/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    maxY
    {
        type            cyclic;
    }
    minX
    {
        type            cyclic;
    }
    maxX
    {
        type            cyclic;
    }
    minY
    {
        type            cyclic;
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    pores
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
