tutorials/suspensionFlows/equilibriumEulerianFoam/2Dpacking/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "ndomains"

numberOfSubdomains $ndomains;

method          simple;

simpleCoeffs
{
    n               ( $ndomainsx $ndomainsy $ndomainsz );
    delta           0.0001;
}


// ************************************************************************* //
