tutorials/suspensionFlows/equilibriumEulerianFoam/2Dpacking/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            vectorSemiImplicitSource;
    active          true;
//    timeStart       0.2;
//    duration        2.0;
    selectionMode   all;

    vectorSemiImplicitSourceCoeffs
    {
        selectionMode all;
        volumeMode      absolute;
        injectionRateSuSp
        {
            U           ((1 0 0) 0);
        }
    }
//    type            pressureGradientExplicitSource;
//    active          on;            //on/off switch
//    selectionMode   all;       //cellSet // points //cellZone
//
//    pressureGradientExplicitSourceCoeffs
//    {
//        fieldNames  (U);
//        Ubar        ( 1 0 0 );
//    }
}


// ************************************************************************* //
