tutorials/suspensionFlows/equilibriumEulerianFoam/2Dpacking/system/ndomains
ndomains 8;
ndomainsx 2;
ndomainsy 2;
ndomainsz 2;
#inputMode merge
