tutorials/suspensionFlows/equilibriumEulerianFoam/2Dpacking/system/tolerance
tol 1e-8;
#inputMode merge
